/*
007.籃球對抗

有A,B,C三隊比賽籃球,每場兩隊比賽四節，贏家的四節總分最高(必有一隊為贏家)，總共M場。輸入每場比賽參與的隊伍名稱和每節兩對比分，求出贏得場數最多的隊伍名稱(必只有一隊)和該隊伍的總比分

【輸入說明】
第一行:輸入籃球比賽場數整數M(3<=M<=10)
第二行:輸入第一場兩個比賽隊伍名稱，中間以空白間隔
第三行:輸入第一場第一節兩隊整數得分，依據第N行名稱順序輸入，中間以空白間隔
第四行:輸入第一場第二節兩隊整數得分，依據第N行名稱順序輸入，中間以空白間隔
第五行:輸入第一場第三節兩隊整數得分，依據第N行名稱順序輸入，中間以空白間隔
第六行:輸入第一場第四節兩隊整數得分，依據第N行名稱順序輸入，中間以空白間隔
.....接下來第2到M場比賽重複第二到六行的流程

範例輸入說明:
3(比賽場數為3)
B C(該場比賽由B、C兩隊競爭)
17 8(第一場第一節B比分17，C比分8)
19 6(第一場第二節B比分19，C比分6)
12 10(第一場第三節B比分12，C比分10)
13 24(第一場第四節B比分13，C比分24)
A B(該場比賽由A、B兩隊競爭)
7 14(第二場第一節A比分7，B比分14)
18 23(第二場第二節A比分18，B比分23)
6 15(第二場第三節A比分6，B比分15)
19 23(第二場第四節A比分19，B比分23)
A C(該場比賽由A、C兩隊競爭)
15 12(第三場第一節A比分15，C比分12)
17 23(第三場第二節A比分17，C比分23)
12 10(第三場第三節A比分12，C比分10)
7 5(第三場第四節A比分7，C比分5)

【輸出說明】
第一行:輸出贏得場數最多的隊伍名稱
第二行後:輸出贏得場數最多的隊伍的總比分

範例輸出說明:
B(總共兩場比賽。第一場比賽B，C兩隊總比分為61:48，B隊獲勝。第二場比賽A，B兩隊總比分是50:75，B隊獲勝。第三場比賽A，C兩隊總比分為53:50，A隊獲勝。B贏的場數最多)
136(B隊的總比分為61+75=136)


【測試資料一】
輸入：
3
A B
12 7
5 9
9 5
6 4
A C
16 12
9 3
14 12
24 13
B C
12 8
14 13
24 16
8 23

輸出：
A
95

【測試資料二】
輸入：
5
B C
12 4
15 18
16 23
6 15
B C
15 8
10 20
14 13
11 10
A B
12 4
16 13
7 9
23 26
A C
14 17
12 23
22 26
24 20
A C
6 12
19 15
13 17
22 24

輸出：
C
265

【測試資料三】
輸入：
7
B C
12 5
7 3
6 9
18 24
A C
24 16
15 13
16 12
8 14
A B
17 12
13 10
25 16
13 21
B C
8 13
7 12
6 14
15 19
A C
13 24
12 9
7 13
15 17
A B
14 17
12 15
13 22
24 16
A C
12 14
22 25
17 12
10 24

輸出：
C
292

*/

#include <stdio.h>

int charToInt(char c) {
  int temp;
  switch (c) {
  case 'A':
    temp = 0;
    break;
  case 'B':
    temp = 1;
    break;
  case 'C':
    temp = 2;
    break;
  }
  return temp;
}

int main() {
  int score[3] = {0}, win[3] = {0}, M;
  char player1, player2;
  int team1, team2;

  scanf("%d", &M);
  for (int i = 0; i < M; i++) {
    scanf(" %c %c", &player1, &player2);
    team1 = charToInt(player1);
    team2 = charToInt(player2);

    int score1, score2;
    for (int j = 0; j < 4; j++) { // 共四場
      scanf("%d %d", &score1, &score2);

      if (score1 > score2) {
        win[team1] += 1;
      } else {
        win[team2] += 1;
      }
      score[team1] += score1;
      score[team2] += score2;
    }
  }
  int max_win = 0;
  int winner;
  for (int i = 0; i < 3; i++) {
    if (win[i] > max_win) {
      max_win = win[i];
      winner = i;
    }
  }
  switch (winner) {
  case 0:
    printf("A\n");
    break;
  case 1:
    printf("B\n");
    break;
  case 2:
    printf("C\n");
    break;
  }
  printf("%d", score[winner]);
}